const quizQuestions = {
  Programming: [
      {
          question: "هل لديك قابلية لتعلم الإنجليزية (أو تتقنها)؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل مستواك أقل من المتوسط في الرياضيات؟",
          options: ["نعم", "لا"],
          correct: "لا",
          weight: 5
      },
      {
          question: "هل أنت مستعد للاطلاع الدائم على هذا المجال (مجال يتطور ويتغير بسرعة)؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل لديك مهارة إدارية؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تتأقلم مع الأمور المعقدة؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تعتمد في خياراتك على؟",
          options: ["الحدس الشعوري", "التفكير المنطقي"],
          correct: "التفكير المنطقي",
          weight: 5
      },
      {
          question: "أنت شخص؟",
          options: ["عشوائي", "منظم ومرتب"],
          correct: "منظم ومرتب",
          weight: 5
      },
      {
          question: "تفضل المهام التي تتطلب؟",
          options: ["حلول إبداعية", "خطوات محددة مسبقًا"],
          correct: "خطوات محددة مسبقًا",
          weight: 5
      },
      {
          question: "تفضل؟",
          options: ["المظهر", "الكفاءة"],
          correct: "الكفاءة",
          weight: 5
      },
      {
          question: "هل يمكنك التركيز على مشروع واحد لفترة طويلة؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تفضل العمل على مشاريع (الراتب يختلف)؟",
          options: ["صغيرة بكثرة", "طويلة أحيانًا"],
          correct: "طويلة أحيانًا",
          weight: 5
      },
      {
          question: "تفضل العمل مع عميل؟",
          options: ["مرة واحدة", "أكثر من مرة"],
          correct: "مرة واحدة",
          weight: 5
      },
      {
          question: "هل يمكنك التأقلم مع فريق للعمل؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تحب الألغاز والتحديات الذهنية؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تستطيع تخصيص وقت ليس بالقصير للتعلم؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل لديك جهاز كمبيوتر؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل تتقبل فكرة أن البرمجة من أصعب المجالات وتأخذ وقتًا منك؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل لديك نظرة فوقية حول مجال البرمجة؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل لديك الاستعداد للجلوس ساعات لتصحيح أخطاء برمجية بسيطة؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      }
  ],
  designer: [
      {
          question: "ماذا تختار",
          options: ["بدا تصميم من الصفر", "العمل بقالب جاهز"],
          correct: "بدا تصميم من الصفر",
          weight: 4
      },
      {
          question: "هل تستمتع بقضاء الوقت في رؤية تصاميم جذابة على المواقع",
          options: ["لا", "نعم"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "عندما تبدأ بالرسم عن طريق الخطأ",
          options: ["ترسم رسمات وأشكال ذات معنى", "رسومات بلا معنى مخربشة"],
          correct: "ترسم رسمات وأشكال ذات معنى",
          weight: 9
      },
      {
          question: "تحب الرسم",
          options: ["لا", "نعم"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "لديك مخيلة تصويرية",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 11
      },
      {
          question: "تهتم بإعادة تدوير أمور منزلية",
          options: ["لا", "نعم"],
          correct: "نعم",
          weight: 4
      },
      {
          question: "تفضل المهام التي تتطلب",
          options: ["حلول إبداعية", "خطوات محددة"],
          correct: "حلول إبداعية",
          weight: 4
      },
      {
          question: "تثيرك الأفكار",
          options: ["البسيطة والسهلة", "المعقدة"],
          correct: "المعقدة",
          weight: 4
      },
      {
          question: "تعتمد في اختياراتك على",
          options: ["الحدس الشعوري", "التفكير المنطقي"],
          correct: "الحدس الشعوري",
          weight: 9
      },
      {
          question: "ترى بأنك تفكر خارج الصندوق",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 4
      },
      {
          question: "تشعر بالملل عندما تأخذ النقاشات منعطف نظري للغاية",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 4
      },
      {
          question: "أريد تصميم موقع إلكتروني يوحي بالحداثة والابتكار، اختار اللون",
          options: ["أبيض وأزرق", "أسود وذهبي"],
          correct: "أبيض وأزرق",
          weight: 4
      },
      {
          question: "عندما ترى تصميم يعجبك ترى بأنك بدأت بالتفكير في آلية تصميمه",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 4
      },
      {
          question: "أي من هذين اللونين يتناسب مع اللون الأصفر",
          options: ["الأزرق الداكن والبرتقالي", "الوردي والأخضر"],
          correct: "الأزرق الداكن والبرتقالي",
          weight: 4
      },
      {
          question: "أريد تصميم يعكس الأناقة والرقي",
          options: ["خط كلاسيكي مزخرف", "خطوط ذات حواف حادة"],
          correct: "خط كلاسيكي مزخرف",
          weight: 4
      },
      {
          question: "هل تفضل",
          options: ["العمل مع عميل مرة واحدة", "العمل مع عميل عدة مرات"],
          correct: "العمل مع عميل عدة مرات",
          weight: 4
      },
      {
          question: "هل تفضل",
          options: ["مشاريع صغيرة بوفرة (أجر متوسط عدة مرات)", "مشاريع كبيرة تأخذ وقت"],
          correct: "مشاريع صغيرة بوفرة (أجر متوسط عدة مرات)",
          weight: 4
      },
      {
        question: " هل لديك القدرة على تقبّل النقد على تصاميمك دون أن تتأثر نفسياً؟",
        options: ["نعم", "لا"],
        correct: "نعم",
        weight: 4
    },
    {
      question: "عند العمل على مشروع تصميم، تفضل أن تبدأ بـ:",
      options: ["العمل مباشرة على الكمبيوتر", "رسم أفكار مبدئية على الورق"],
      correct: "رسم أفكار مبدئية على الورق",
      weight: 4
  },
  {
    question: "تفضل العمل في بيئة:",
    options: ["هادئة ومنظمة", "مليئة بالحركة والنشاط"],
    correct: "هادئة ومنظمة",
    weight: 4
},
  ],
  "video-editing": [
      {
          question: "هل يمكنك البقاء هادئًا حتى تحت الضغط الكبير",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تحب التعلم",
          options: ["تطبيقيًا", "نظريًا"],
          correct: "تطبيقيًا",
          weight: 5
      },
      {
          question: "هل تستمتع بمشاهدة الإيديت (لكرة القدم أو الأنمي أو..)",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل عندما تشاهد فيديو ترى بأنك بدأت تفكر في آلية عمله وانتقالاته",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تحب الرسم",
          options: ["نعم", "ليس كثيرًا"],
          correct: "ليس كثيرًا",
          weight: 5
      },
      {
          question: "هل تحب العمل الفردي",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل توصف بأنك شخص عشوائي",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تفضل المهام التي تتطلب",
          options: ["اتباع خطوات محددة", "حلول إبداعية"],
          correct: "حلول إبداعية",
          weight: 5
      },
      {
          question: "تفكر خارج الصندوق",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل لديك مهارة سرد الأحداث (تترك انطباعًا على من يسمع قصصك الشخصية)",
          options: ["لا", "نعم"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تهتم بأدق التفاصيل",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "مكان عملك وعيشك مرتب ونظيف",
          options: ["لا", "نعم"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "العمل مع",
          options: ["عميل واحد عدة مرات", "عميل واحد مرة واحدة"],
          correct: "عميل واحد عدة مرات",
          weight: 5
      },
      {
        question: "هل تجد متعة في تعديل أو تحسين شيء موجود ليبدو أفضل؟",
        options: ["لا","نعم"],
        correct: "نعم",
        weight: 5
    },
    {
      question: "العمل على",
      options: ["مشاريع كبيرة متفرقة", "عدة مشاريع صغيرة"],
      correct: "عدة مشاريع صغيرة",
      weight: 5
  },
  {
    question: "هل تستطيع الجلوس لساعات طويلة على جهاز الكمبيوتر دون الشعور بالملل؟",
    options: ["لا", "نعم"],
    correct: "نعم",
    weight: 5
},
{
  question: "هل تشعر بالرضا عند رؤية مشروعك يخرج بشكل متقن كما تخيلته؟",
  options: ["لا", "نعم"],
  correct: "نعم",
  weight: 5
},
{
  question: " هل لديك حس موسيقي(لا تستعمل الموسيقى) أو اهتمام بتناسق الصوت مع الصورة؟",
  options: ["لا", "نعم"],
  correct: "نعم",
  weight: 5
},
{
  question: "هل تستمتع باستخدام برامج مثل CapCut ",
  options: ["لا", "نعم"],
  correct: "نعم",
  weight: 5
},
{
  question: "هل تمانع العمل على نفس المشروع لأيام أو حتى أسابيع لتحسينه وإتقانه؟",
  options: ["لا أمانع، أحب التعمق في المشاريع", " أفضل الأعمال السريعة والمتغيرة"],
  correct: "لا أمانع، أحب التعمق في المشاريع",
  weight: 3
},
  ],
  "voice-over": [
      {
          question: "هل تستطيع تغيير نبرة صوتك (إعلاني، درامي، وثائقي)",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "عندما تسمع صوتك المسجل أو يسمعه أصدقاؤك، هل يرون بأنه جيد؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل تستطيع التعبير عن المشاعر بصوتك (حزن، فرح، قلق)؟",
          options: ["نعم", "لا"],
          correct: "نعم",        
          weight: 7
      },
      {
          question: "هل لديك صعوبة في مخارج الحروف؟",
          options: ["نعم", "لا"],
          correct: "لا",
          weight: 7
      },
      {
          question: "هل لديك التحكم الكامل بنبرة صوتك؟",
          options: ["لا", "نعم"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل لديك التحكم الكامل في سرعة القراءة والوقف والابتداء؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل تتحلى بالصبر وتستطيع إعادة الشيء أكثر من 5 مرات؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل تستطيع توفير بيئة تسجيل مناسبة؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل أنت مستعد لشراء ميكروفون للتسجيل؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل أنت مستعد لتعلم برامج التحرير الصوتي؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 7
      },
      {
          question: "هل تتقن النحو في اللغة العربية؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل تتقن لغة ثانية؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل تهتم بالتفاصيل الصغيرة؟",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 6
      },
      {
          question: "هل توصف بأنك إنسان عشوائي وغير مرتب؟",
          options: ["لا", "نعم"],
          correct: "لا",
          weight: 6
      },
      {
          question: "كيف تصف نفسك في الإلقاء علنيًا؟",
          options: ["جيد", "متوتر"],
          correct: "جيد",
          weight: 6
      }
  ],
  scriptwriting: [
      {
          question: "هل تجد نفسك تفكر كثيرا في القصص والحوارات",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 10
      },
      {
          question: "تجيد قواعد اللغة العربية",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "مطلع على الادب العربي",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "ليس لديك اخطاء في التشكيل والنحو",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تجيد الاملاء بلا اخطاء",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "لديك القدرة على فهم نفسيات الاشخاص",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "توصف بانك شخص موهوب في الاقناع",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "هل تستطيع العمل على مشروع لفترة طويلة دون فقد الحماس",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "يمكنك العمل مع فريق",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تستطيع العمل تحت الظغط",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "مستعد لتعلم تقنيات وادوات كتابة السيناريو",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "لديك القدرة على ايصال الافكار عن طريق الكتابة",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تستطيع كتابة حوارات واقعية",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تفهم اساسيات بناء القصة",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "لديك مهارة التلخيص او تستطيع تعلمها",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تلتزم بالمواعيد",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "تستطيع توفير مكان هادئ للكتابة",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 5
      },
      {
          question: "كنت متفوق في التعبير اثناء دراستك",
          options: ["نعم", "لا"],
          correct: "نعم",
          weight: 10
      }
  ]
};